app/controllers/horses_controller.rb

SELECT "horses".* FROM "horses"
---
  def index
    @horses = Horse.all

INSERT INTO "horses" ("name", "sex", "created_at", "updated_at", "age", "breed", "color", "personality", "bio", "location") VALUES ('Thunder', 1, '2025-10-06 22:20:33.399442', '2025-10-06 22:20:33.399442', 17, 'Arabian', 'Bay', 'STRONG NOT DEMURE', 'just a chill horse what can he say', 'Austin, Texas') RETURNING "id"
---
  def create
    @horse = Horse.new(horse_params)

    respond_to do |format|
      if @horse.save

UPDATE "horses" SET "updated_at" = '2025-10-06 22:19:22.987197', "bio" = 'Thunder is a magnificent Arabian stallion with a heart of gold. He loves long trail rides and has a playful personality that will keep you entertained. He''s looking for a mare who shares his love for adventure and can keep up with his energetic spirit. So majestic!' WHERE "horses"."id" = 1
---
  def update
    respond_to do |format|
      if @horse.update(horse_params)

DELETE FROM "horses" WHERE "horses"."id" = 1
---
  def destroy
    @horse.destroy!

SELECT "horses".* FROM "horses" WHERE "horses"."id" = 1 LIMIT 1
---
    def set_horse
      @horse = Horse.find(params.expect(:id))